app/controllers/users_controller.rb

  def check_number_emails
    if User.all.count < 25
---
SELECT COUNT(*) FROM `users`

  def create
    @user = User.new(user_params)
    @exists = User.user_exists(user_params[:email])
    respond_to do |format|
      if !@exists
        if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `created_at`, `updated_at`) VALUES ('Lovro', 'Podgoršek', 'lovropodgorsek@gmail.com', '2015-05-10 22:17:53.941765', '2015-05-10 22:17:53.941765')